# Loading the Package

In [1]:
# Importing Pandas 

import pandas as pd
import numpy as np

# Data Preprocessing

In [3]:
# Importing CAB DATA file into Pandas

dfcab = pd.read_excel(r'C:\Users\MMOHIUD2\Desktop\Internship\CAB Project\CAB DATA.xlsx')

In [4]:
# Inspecting the data 

dfcab.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,2016-01-08 00:00:00,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,2016-01-09 00:00:00,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,2016-01-10 00:00:00,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,2016-01-11 00:00:00,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,2016-01-12 00:00:00,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [4]:
# Checking CAB DATA properties

dfcab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  object
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(1), object(3)
memory usage: 19.2+ MB

In [69]:
# Checking for null values

dfcab.isnull(). values. any()

False

In [70]:
# Checking for duplicate values

dfcab.duplicated(). values. any()

False

In [71]:
# Checking for blank values

dfcab.eq(''). values. any()

False

In [5]:
# Importing CITY DATA file into Pandas

dfcity = pd.read_excel(r'C:\Users\MMOHIUD2\Desktop\Internship\CAB Project\CITY DATA.xlsx')

In [16]:
# Checking CITY DATA properties

dfcity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     int64
 2   Users       20 non-null     int64
dtypes: int64(2), object(1)
memory usage: 608.0+ bytes

In [18]:
# Inspecting the data 

dfcity.head()

             City  Population   Users
0     NEW YORK NY     8405837  302149
1      CHICAGO IL     1955130  164468
2  LOS ANGELES CA     1595037  144132
3        MIAMI FL     1339155   17675
4  SILICON VALLEY     1177609   27247

In [37]:
# Checking for null values

dfcity.isnull(). values. any()

False

In [34]:
# Checking for duplicate values

dfcity.duplicated().values.any()

False

In [35]:
# Checking for blank values

dfcity.eq('').values.any()

False

In [6]:
# Importing CUSTOMER DATA file into Pandas

dfcustomer = pd.read_excel(r'C:\Users\MMOHIUD2\Desktop\Internship\CAB Project\CUSTOMER ID.xlsx')

In [41]:
# Checking CUSTOMER DATA properties

dfcustomer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [42]:
# Inspecting the data 

dfcustomer.head()

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536

In [43]:
# Checking for null values

dfcustomer.isnull(). values. any()

False

In [44]:
# Checking for duplicate values

dfcustomer.duplicated().values.any()

False

In [45]:
# Checking for blank values

dfcustomer.eq('').values.any()

False

In [7]:
# Importing  TRANSACTION DATA file into Pandas

dftransaction = pd.read_excel(r'C:\Users\MMOHIUD2\Desktop\Internship\CAB Project\TRANSACTION ID.xlsx')

In [47]:
dftransaction.head()

   Transaction ID  Customer ID Payment_Mode
0        10000011        29290         Card
1        10000012        27703         Card
2        10000013        28712         Cash
3        10000014        28020         Cash
4        10000015        27182         Card

In [48]:
dftransaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

In [49]:
# Checking for null values

dftransaction.isnull(). values. any()

False

In [50]:
# Checking for duplicate values

dftransaction.duplicated().values.any()

False

In [51]:
# Checking for blank values

dftransaction.eq('').values.any()

False

In [40]:
# Merging CITY and CAB Data files 

cityncab = pd.merge(dfcity,dfcab,on='City')

In [49]:
# Merging CUSTOMER and TRANSACTION Data files 

customerntransaction = pd.merge(dfcustomer,dftransaction,on='Customer ID')

In [83]:
# Merging all the data files

All = pd.merge(cityncab,customerntransaction,on='Transaction ID')
All.head()

,City,Population,Users,Transaction ID,Date of Travel,Company,KM Travelled,Price Charged,Cost of Trip,Customer ID,Gender,Age,Income (USD/Month),Payment_Mode
0,NEW YORK NY,8405837,302149,10000139,2016-05-15 00:00:00,Pink Cab,17.85,242.90,198.135,2416,Male,28,21399,Cash
1,NEW YORK NY,8405837,302149,10000140,2016-05-16 00:00:00,Pink Cab,25.30,407.21,255.530,2060,Male,18,8149,Card
2,NEW YORK NY,8405837,302149,10000141,2016-05-17 00:00:00,Pink Cab,16.32,236.41,186.048,1451,Male,35,23989,Card
3,NEW YORK NY,8405837,302149,10000142,2016-05-18 00:00:00,Pink Cab,12.43,194.61,144.188,1609,Male,30,23036,Card
4,NEW YORK NY,8405837,302149,10000143,2016-05-19 00:00:00,Pink Cab,29.70,434.57,350.460,2927,Male,33,14520,Cash

In [87]:
All.groupby('Company').median()

,Population,Users,Transaction ID,KM Travelled,Price Charged,Cost of Trip,Customer ID,Age,Income (USD/Month)
Company,,,,,,,,,
Pink Cab,1595037.0,144132.0,10225904.0,22.44,298.06,246.330,8876.0,33.0,14713.0
Yellow Cab,1595037.0,144132.0,10219868.0,22.44,425.06,295.596,6445.0,33.0,14676.0

In [86]:
All.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 359392 entries, 0 to 359391
Data columns (total 14 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   City                359392 non-null  object
 1   Population          359392 non-null  int64
 2   Users               359392 non-null  int64
 3   Transaction ID      359392 non-null  int64
 4   Date of Travel      359392 non-null  object
 5   Company             359392 non-null  object
 6   KM Travelled        359392 non-null  float64
 7   Price Charged       359392 non-null  float64
 8   Cost of Trip        359392 non-null  float64
 9   Customer ID         359392 non-null  int64
 10  Gender              359392 non-null  object
 11  Age                 359392 non-null  int64
 12  Income (USD/Month)  359392 non-null  int64
 13  Payment_Mode        359392 non-null  object
dtypes: float64(3), int64(6), object(5)
memory usage: 41.1+ MB

# Hypothesis Development - Work In Progress

In [62]:
import statsmodels.api as sm
from statsmodels.formula.api import ols

In [53]:
Income = customerntransaction[['Income (USD/Month)']]
Gender = customerntransaction[['Gender']]
Age = customerntransaction[['Age']]

In [64]:
model = ols('Income ~ C(Gender) + C(Age) + C(Gender):C(Age)', data=customerntransaction).fit()
sm.stats.anova_lm(model, typ=1)

,df,sum_sq,mean_sq,F,PR(>F)
C(Gender),1.0,8.152851e+08,8.152851e+08,12.833925,3.404277e-04
C(Age),47.0,6.626067e+10,1.409801e+09,22.192587,1.507279e-187
C(Gender):C(Age),47.0,5.837137e+10,1.241944e+09,19.550237,7.119670e-162
Residual,440002.0,2.795147e+13,6.352578e+07,NaN,NaN